runs/todolist__arm_b_spring__null-agent__t1__rep1__20260611T131727Z/logs/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ggalazzo/workspace/personal/recq-rigor-study/perf/todolist/workload.js
        output: -

     scenarios: (100.00%) 2 scenarios, 25 max VUs, 2m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 30s (gracefulStop: 5s)
              * load: 20 looping VUs for 2m0s (startTime: 30s, gracefulStop: 10s)


running (0m01.0s), 05/25 VUs, 45 complete and 0 interrupted iterations
warmup   [   3% ] 5 VUs    01.0s/30s
load   • [   0% ] waiting  29.0s

running (0m02.0s), 05/25 VUs, 90 complete and 0 interrupted iterations
warmup   [   7% ] 5 VUs    02.0s/30s
load   • [   0% ] waiting  28.0s

running (0m03.0s), 05/25 VUs, 135 complete and 0 interrupted iterations
warmup   [  10% ] 5 VUs    03.0s/30s
load   • [   0% ] waiting  27.0s

running (0m04.0s), 05/25 VUs, 185 complete and 0 interrupted iterations
warmup   [  13% ] 5 VUs    04.0s/30s
load   • [   0% ] waiting  26.0s

running (0m05.0s), 05/25 VUs, 230 complete and 0 interrupted iterations
warmup   [  17% ] 5 VUs    05.0s/30s
load   • [   0% ] waiting  25.0s

running (0m06.0s), 05/25 VUs, 275 complete and 0 interrupted iterations
warmup   [  20% ] 5 VUs    06.0s/30s
load   • [   0% ] waiting  24.0s

running (0m07.0s), 05/25 VUs, 325 complete and 0 interrupted iterations
warmup   [  23% ] 5 VUs    07.0s/30s
load   • [   0% ] waiting  23.0s

running (0m08.0s), 05/25 VUs, 375 complete and 0 interrupted iterations
warmup   [  27% ] 5 VUs    08.0s/30s
load   • [   0% ] waiting  22.0s

running (0m09.0s), 05/25 VUs, 420 complete and 0 interrupted iterations
warmup   [  30% ] 5 VUs    09.0s/30s
load   • [   0% ] waiting  21.0s

running (0m10.0s), 05/25 VUs, 470 complete and 0 interrupted iterations
warmup   [  33% ] 5 VUs    10.0s/30s
load   • [   0% ] waiting  20.0s

running (0m11.0s), 05/25 VUs, 515 complete and 0 interrupted iterations
warmup   [  37% ] 5 VUs    11.0s/30s
load   • [   0% ] waiting  19.0s

running (0m12.0s), 05/25 VUs, 565 complete and 0 interrupted iterations
warmup   [  40% ] 5 VUs    12.0s/30s
load   • [   0% ] waiting  18.0s

running (0m13.0s), 05/25 VUs, 610 complete and 0 interrupted iterations
warmup   [  43% ] 5 VUs    13.0s/30s
load   • [   0% ] waiting  17.0s

running (0m14.0s), 05/25 VUs, 655 complete and 0 interrupted iterations
warmup   [  47% ] 5 VUs    14.0s/30s
load   • [   0% ] waiting  16.0s

running (0m15.0s), 05/25 VUs, 705 complete and 0 interrupted iterations
warmup   [  50% ] 5 VUs    15.0s/30s
load   • [   0% ] waiting  15.0s

running (0m16.0s), 05/25 VUs, 750 complete and 0 interrupted iterations
warmup   [  53% ] 5 VUs    16.0s/30s
load   • [   0% ] waiting  14.0s

running (0m17.0s), 05/25 VUs, 800 complete and 0 interrupted iterations
warmup   [  57% ] 5 VUs    17.0s/30s
load   • [   0% ] waiting  13.0s

running (0m18.0s), 05/25 VUs, 845 complete and 0 interrupted iterations
warmup   [  60% ] 5 VUs    18.0s/30s
load   • [   0% ] waiting  12.0s

running (0m19.0s), 05/25 VUs, 895 complete and 0 interrupted iterations
warmup   [  63% ] 5 VUs    19.0s/30s
load   • [   0% ] waiting  11.0s

running (0m20.0s), 05/25 VUs, 940 complete and 0 interrupted iterations
warmup   [  67% ] 5 VUs    20.0s/30s
load   • [   0% ] waiting  10.0s

running (0m21.0s), 05/25 VUs, 989 complete and 0 interrupted iterations
warmup   [  70% ] 5 VUs    21.0s/30s
load   • [   0% ] waiting  09.0s

running (0m22.0s), 05/25 VUs, 1035 complete and 0 interrupted iterations
warmup   [  73% ] 5 VUs    22.0s/30s
load   • [   0% ] waiting  08.0s

running (0m23.0s), 05/25 VUs, 1080 complete and 0 interrupted iterations
warmup   [  77% ] 5 VUs    23.0s/30s
load   • [   0% ] waiting  07.0s

running (0m24.0s), 05/25 VUs, 1130 complete and 0 interrupted iterations
warmup   [  80% ] 5 VUs    24.0s/30s
load   • [   0% ] waiting  06.0s

running (0m25.0s), 05/25 VUs, 1175 complete and 0 interrupted iterations
warmup   [  83% ] 5 VUs    25.0s/30s
load   • [   0% ] waiting  05.0s

running (0m26.0s), 05/25 VUs, 1220 complete and 0 interrupted iterations
warmup   [  87% ] 5 VUs    26.0s/30s
load   • [   0% ] waiting  04.0s

running (0m27.0s), 05/25 VUs, 1270 complete and 0 interrupted iterations
warmup   [  90% ] 5 VUs    27.0s/30s
load   • [   0% ] waiting  03.0s

running (0m28.0s), 05/25 VUs, 1315 complete and 0 interrupted iterations
warmup   [  93% ] 5 VUs    28.0s/30s
load   • [   0% ] waiting  02.0s

running (0m29.0s), 05/25 VUs, 1365 complete and 0 interrupted iterations
warmup   [  97% ] 5 VUs    29.0s/30s
load   • [   0% ] waiting  01.0s

running (0m30.0s), 05/25 VUs, 1410 complete and 0 interrupted iterations
warmup   [ 100% ] 5 VUs    30.0s/30s
load   • [   0% ] waiting  00.0s

running (0m31.0s), 20/25 VUs, 1597 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   1% ] 20 VUs  0m01.0s/2m0s

running (0m32.0s), 20/25 VUs, 1777 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   2% ] 20 VUs  0m02.0s/2m0s

running (0m33.0s), 20/25 VUs, 1977 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   2% ] 20 VUs  0m03.0s/2m0s

running (0m34.0s), 20/25 VUs, 2170 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   3% ] 20 VUs  0m04.0s/2m0s

running (0m35.0s), 20/25 VUs, 2357 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   4% ] 20 VUs  0m05.0s/2m0s

running (0m36.0s), 20/25 VUs, 2557 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   5% ] 20 VUs  0m06.0s/2m0s

running (0m37.0s), 20/25 VUs, 2737 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   6% ] 20 VUs  0m07.0s/2m0s

running (0m38.0s), 20/25 VUs, 2918 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   7% ] 20 VUs  0m08.0s/2m0s

running (0m39.0s), 20/25 VUs, 3117 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   7% ] 20 VUs  0m09.0s/2m0s

running (0m40.0s), 20/25 VUs, 3297 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   8% ] 20 VUs  0m10.0s/2m0s

running (0m41.0s), 20/25 VUs, 3497 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [   9% ] 20 VUs  0m11.0s/2m0s

running (0m42.0s), 20/25 VUs, 3677 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  10% ] 20 VUs  0m12.0s/2m0s

running (0m43.0s), 20/25 VUs, 3877 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  11% ] 20 VUs  0m13.0s/2m0s

running (0m44.0s), 20/25 VUs, 4057 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  12% ] 20 VUs  0m14.0s/2m0s

running (0m45.0s), 20/25 VUs, 4257 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  12% ] 20 VUs  0m15.0s/2m0s

running (0m46.0s), 20/25 VUs, 4437 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  13% ] 20 VUs  0m16.0s/2m0s

running (0m47.0s), 20/25 VUs, 4637 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  14% ] 20 VUs  0m17.0s/2m0s

running (0m48.0s), 20/25 VUs, 4835 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  15% ] 20 VUs  0m18.0s/2m0s

running (0m49.0s), 20/25 VUs, 5017 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  16% ] 20 VUs  0m19.0s/2m0s

running (0m50.0s), 20/25 VUs, 5217 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  17% ] 20 VUs  0m20.0s/2m0s

running (0m51.0s), 20/25 VUs, 5397 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  17% ] 20 VUs  0m21.0s/2m0s

running (0m52.0s), 20/25 VUs, 5597 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  18% ] 20 VUs  0m22.0s/2m0s

running (0m53.0s), 20/25 VUs, 5777 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  19% ] 20 VUs  0m23.0s/2m0s

running (0m54.0s), 20/25 VUs, 5969 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  20% ] 20 VUs  0m24.0s/2m0s

running (0m55.0s), 20/25 VUs, 6157 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  21% ] 20 VUs  0m25.0s/2m0s

running (0m56.0s), 20/25 VUs, 6339 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  22% ] 20 VUs  0m26.0s/2m0s

running (0m57.0s), 20/25 VUs, 6537 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  22% ] 20 VUs  0m27.0s/2m0s

running (0m58.0s), 20/25 VUs, 6719 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  23% ] 20 VUs  0m28.0s/2m0s

running (0m59.0s), 20/25 VUs, 6917 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  24% ] 20 VUs  0m29.0s/2m0s

running (1m00.0s), 20/25 VUs, 7099 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  25% ] 20 VUs  0m30.0s/2m0s

running (1m01.0s), 20/25 VUs, 7297 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  26% ] 20 VUs  0m31.0s/2m0s

running (1m02.0s), 20/25 VUs, 7479 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  27% ] 20 VUs  0m32.0s/2m0s

running (1m03.0s), 20/25 VUs, 7659 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  27% ] 20 VUs  0m33.0s/2m0s

running (1m04.0s), 20/25 VUs, 7859 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  28% ] 20 VUs  0m34.0s/2m0s

running (1m05.0s), 20/25 VUs, 8039 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  29% ] 20 VUs  0m35.0s/2m0s

running (1m06.0s), 20/25 VUs, 8239 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  30% ] 20 VUs  0m36.0s/2m0s

running (1m07.0s), 20/25 VUs, 8419 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  31% ] 20 VUs  0m37.0s/2m0s

running (1m08.0s), 20/25 VUs, 8606 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  32% ] 20 VUs  0m38.0s/2m0s

running (1m09.0s), 20/25 VUs, 8790 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  32% ] 20 VUs  0m39.0s/2m0s

running (1m10.0s), 20/25 VUs, 8984 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  33% ] 20 VUs  0m40.0s/2m0s

running (1m11.0s), 20/25 VUs, 9173 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  34% ] 20 VUs  0m41.0s/2m0s

running (1m12.0s), 20/25 VUs, 9362 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  35% ] 20 VUs  0m42.0s/2m0s

running (1m13.0s), 20/25 VUs, 9544 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  36% ] 20 VUs  0m43.0s/2m0s

running (1m14.0s), 20/25 VUs, 9741 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  37% ] 20 VUs  0m44.0s/2m0s

running (1m15.0s), 20/25 VUs, 9924 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  37% ] 20 VUs  0m45.0s/2m0s

running (1m16.0s), 20/25 VUs, 10106 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  38% ] 20 VUs  0m46.0s/2m0s

running (1m17.0s), 20/25 VUs, 10287 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  39% ] 20 VUs  0m47.0s/2m0s

running (1m18.0s), 20/25 VUs, 10485 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  40% ] 20 VUs  0m48.0s/2m0s

running (1m19.0s), 20/25 VUs, 10667 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  41% ] 20 VUs  0m49.0s/2m0s

running (1m20.0s), 20/25 VUs, 10847 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  42% ] 20 VUs  0m50.0s/2m0s

running (1m21.0s), 20/25 VUs, 11047 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  42% ] 20 VUs  0m51.0s/2m0s

running (1m22.0s), 20/25 VUs, 11227 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  43% ] 20 VUs  0m52.0s/2m0s

running (1m23.0s), 20/25 VUs, 11427 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  44% ] 20 VUs  0m53.0s/2m0s

running (1m24.0s), 20/25 VUs, 11607 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  45% ] 20 VUs  0m54.0s/2m0s

running (1m25.0s), 20/25 VUs, 11807 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  46% ] 20 VUs  0m55.0s/2m0s

running (1m26.0s), 20/25 VUs, 11978 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  47% ] 20 VUs  0m56.0s/2m0s

running (1m27.0s), 20/25 VUs, 12167 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  47% ] 20 VUs  0m57.0s/2m0s

running (1m28.0s), 20/25 VUs, 12367 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  48% ] 20 VUs  0m58.0s/2m0s

running (1m29.0s), 20/25 VUs, 12547 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  49% ] 20 VUs  0m59.0s/2m0s

running (1m30.0s), 20/25 VUs, 12747 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  50% ] 20 VUs  1m00.0s/2m0s

running (1m31.0s), 20/25 VUs, 12927 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  51% ] 20 VUs  1m01.0s/2m0s

running (1m32.0s), 20/25 VUs, 13127 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  52% ] 20 VUs  1m02.0s/2m0s

running (1m33.0s), 20/25 VUs, 13307 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  52% ] 20 VUs  1m03.0s/2m0s

running (1m34.0s), 20/25 VUs, 13507 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  53% ] 20 VUs  1m04.0s/2m0s

running (1m35.0s), 20/25 VUs, 13687 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  54% ] 20 VUs  1m05.0s/2m0s

running (1m36.0s), 20/25 VUs, 13887 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  55% ] 20 VUs  1m06.0s/2m0s

running (1m37.0s), 20/25 VUs, 14067 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  56% ] 20 VUs  1m07.0s/2m0s

running (1m38.0s), 20/25 VUs, 14247 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  57% ] 20 VUs  1m08.0s/2m0s

running (1m39.0s), 20/25 VUs, 14447 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  57% ] 20 VUs  1m09.0s/2m0s

running (1m40.0s), 20/25 VUs, 14627 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  58% ] 20 VUs  1m10.0s/2m0s

running (1m41.0s), 20/25 VUs, 14801 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  59% ] 20 VUs  1m11.0s/2m0s

running (1m42.0s), 20/25 VUs, 14987 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  60% ] 20 VUs  1m12.0s/2m0s

running (1m43.0s), 20/25 VUs, 15182 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  61% ] 20 VUs  1m13.0s/2m0s

running (1m44.0s), 20/25 VUs, 15366 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  62% ] 20 VUs  1m14.0s/2m0s

running (1m45.0s), 20/25 VUs, 15562 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  62% ] 20 VUs  1m15.0s/2m0s

running (1m46.0s), 20/25 VUs, 15746 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  63% ] 20 VUs  1m16.0s/2m0s

running (1m47.0s), 20/25 VUs, 15927 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  64% ] 20 VUs  1m17.0s/2m0s

running (1m48.0s), 20/25 VUs, 16107 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  65% ] 20 VUs  1m18.0s/2m0s

running (1m49.0s), 20/25 VUs, 16307 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  66% ] 20 VUs  1m19.0s/2m0s

running (1m50.0s), 20/25 VUs, 16487 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  67% ] 20 VUs  1m20.0s/2m0s

running (1m51.0s), 20/25 VUs, 16670 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  67% ] 20 VUs  1m21.0s/2m0s

running (1m52.0s), 20/25 VUs, 16867 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  68% ] 20 VUs  1m22.0s/2m0s

running (1m53.0s), 20/25 VUs, 17048 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  69% ] 20 VUs  1m23.0s/2m0s

running (1m54.0s), 20/25 VUs, 17247 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  70% ] 20 VUs  1m24.0s/2m0s

running (1m55.0s), 20/25 VUs, 17423 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  71% ] 20 VUs  1m25.0s/2m0s

running (1m56.0s), 20/25 VUs, 17607 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  72% ] 20 VUs  1m26.0s/2m0s

running (1m57.0s), 20/25 VUs, 17807 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  72% ] 20 VUs  1m27.0s/2m0s

running (1m58.0s), 20/25 VUs, 17987 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  73% ] 20 VUs  1m28.0s/2m0s

running (1m59.0s), 20/25 VUs, 18167 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  74% ] 20 VUs  1m29.0s/2m0s

running (2m00.0s), 20/25 VUs, 18367 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  75% ] 20 VUs  1m30.0s/2m0s

running (2m01.0s), 20/25 VUs, 18547 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  76% ] 20 VUs  1m31.0s/2m0s

running (2m02.0s), 20/25 VUs, 18727 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  77% ] 20 VUs  1m32.0s/2m0s

running (2m03.0s), 20/25 VUs, 18927 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  77% ] 20 VUs  1m33.0s/2m0s

running (2m04.0s), 20/25 VUs, 19107 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  78% ] 20 VUs  1m34.0s/2m0s

running (2m05.0s), 20/25 VUs, 19299 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  79% ] 20 VUs  1m35.0s/2m0s

running (2m06.0s), 20/25 VUs, 19487 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  80% ] 20 VUs  1m36.0s/2m0s

running (2m07.0s), 20/25 VUs, 19687 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  81% ] 20 VUs  1m37.0s/2m0s

running (2m08.0s), 20/25 VUs, 19867 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  82% ] 20 VUs  1m38.0s/2m0s

running (2m09.0s), 20/25 VUs, 20047 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  82% ] 20 VUs  1m39.0s/2m0s

running (2m10.0s), 20/25 VUs, 20247 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  83% ] 20 VUs  1m40.0s/2m0s

running (2m11.0s), 20/25 VUs, 20427 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  84% ] 20 VUs  1m41.0s/2m0s

running (2m12.0s), 20/25 VUs, 20609 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  85% ] 20 VUs  1m42.0s/2m0s

running (2m13.0s), 20/25 VUs, 20787 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  86% ] 20 VUs  1m43.0s/2m0s

running (2m14.0s), 20/25 VUs, 20987 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  87% ] 20 VUs  1m44.0s/2m0s

running (2m15.0s), 20/25 VUs, 21167 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  87% ] 20 VUs  1m45.0s/2m0s

running (2m16.0s), 20/25 VUs, 21367 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  88% ] 20 VUs  1m46.0s/2m0s

running (2m17.0s), 20/25 VUs, 21547 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  89% ] 20 VUs  1m47.0s/2m0s

running (2m18.0s), 20/25 VUs, 21747 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  90% ] 20 VUs  1m48.0s/2m0s

running (2m19.0s), 20/25 VUs, 21927 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  91% ] 20 VUs  1m49.0s/2m0s

running (2m20.0s), 20/25 VUs, 22107 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  92% ] 20 VUs  1m50.0s/2m0s

running (2m21.0s), 20/25 VUs, 22307 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  92% ] 20 VUs  1m51.0s/2m0s

running (2m22.0s), 20/25 VUs, 22487 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  93% ] 20 VUs  1m52.0s/2m0s

running (2m23.0s), 20/25 VUs, 22667 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  94% ] 20 VUs  1m53.0s/2m0s

running (2m24.0s), 20/25 VUs, 22867 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  95% ] 20 VUs  1m54.0s/2m0s

running (2m25.0s), 20/25 VUs, 23047 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  96% ] 20 VUs  1m55.0s/2m0s

running (2m26.0s), 20/25 VUs, 23247 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  97% ] 20 VUs  1m56.0s/2m0s

running (2m27.0s), 20/25 VUs, 23427 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  97% ] 20 VUs  1m57.0s/2m0s

running (2m28.0s), 20/25 VUs, 23607 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  98% ] 20 VUs  1m58.0s/2m0s

running (2m29.0s), 20/25 VUs, 23807 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [  99% ] 20 VUs  1m59.0s/2m0s

running (2m30.0s), 20/25 VUs, 23987 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load     [ 100% ] 20 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration{endpoint:add_item,phase:load}
    ✓ 'p(95)<2000' p(95)=7.36ms

    http_req_duration{endpoint:check_item,phase:load}
    ✓ 'p(95)<2000' p(95)=6.73ms

    http_req_duration{endpoint:get_list,phase:load}
    ✓ 'p(95)<1000' p(95)=7.69ms

    http_req_duration{endpoint:get_notifications,phase:load}
    ✓ 'p(95)<1000' p(95)=7.81ms

    http_req_duration{endpoint:get_stats,phase:load}
    ✓ 'p(95)<1000' p(95)=7.88ms


  █ TOTAL RESULTS 

    checks_total.......: 24027  160.070914/s
    checks_succeeded...: 29.93% 7192 out of 24027
    checks_failed......: 70.06% 16835 out of 24027

    ✓ notifications readable
    ✓ list readable
    ✗ check accepted
      ↳  0% — ✓ 0 / ✗ 7214
    ✗ stats readable
      ↳  0% — ✓ 0 / ✗ 2446
    ✗ item accepted
      ↳  0% — ✓ 0 / ✗ 7175

    HTTP
    http_req_duration.............................: avg=3.15ms   min=220µs    med=2.44ms   max=92.67ms  p(90)=5.63ms   p(95)=7.41ms  
      { endpoint:add_item,phase:load }............: avg=2.98ms   min=248µs    med=2.17ms   max=68.88ms  p(90)=5.62ms   p(95)=7.36ms  
      { endpoint:check_item,phase:load }..........: avg=3.48ms   min=749µs    med=2.77ms   max=85.48ms  p(90)=5.2ms    p(95)=6.73ms  
      { endpoint:get_list,phase:load }............: avg=3.14ms   min=234µs    med=2.23ms   max=86.34ms  p(90)=5.88ms   p(95)=7.69ms  
      { endpoint:get_notifications,phase:load }...: avg=3ms      min=259µs    med=2.2ms    max=56.64ms  p(90)=5.83ms   p(95)=7.81ms  
      { endpoint:get_stats,phase:load }...........: avg=3.15ms   min=220µs    med=2.16ms   max=92.67ms  p(90)=5.91ms   p(95)=7.88ms  
    http_req_failed...............................: 100.00% 31242 out of 31242
    http_reqs.....................................: 31242   208.138157/s

    EXECUTION
    iteration_duration............................: avg=106.18ms min=100.31ms med=105.07ms max=222.58ms p(90)=111.39ms p(95)=114.07ms
    iterations....................................: 24027   160.070914/s
    vus...........................................: 20      min=5              max=20
    vus_max.......................................: 25      min=25             max=25

    NETWORK
    data_received.................................: 11 MB   75 kB/s
    data_sent.....................................: 5.8 MB  39 kB/s



running (2m30.1s), 00/25 VUs, 24027 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 5 VUs   30s
load   ✓ [ 100% ] 20 VUs  2m0s

--- stderr ---